# 1) შექმენით 3 ელემენტიანი სახელების სია. მომხმარებელს შემოატანინეთ 0-დან 2-ის ჩათვლით ნებისმიერი რიცხვი, სანამ მომხმარებელი არ შემოიტანს რიცხვს საჭირო დიაპაზონში, ხელახლა ვთხოვოთ რიცხვის შემოტანა.(გამოიყენეთ while loop-ი)

names = ["ანა", "გიორგი", "მარიამი"]

while True:
    index = int(input("შეიყვანეთ რიცხვი 0-დან 2-ის ჩათვლით: "))
    if 0 <= index <= 2:
        break
    print("გთხოვთ, შეიყვანეთ სწორი რიცხვი!")

print("თქვენი არჩეული სახელი:", names[index])

# 2) რატომ გამოიტანს ეს კოდი შეცდომას?

word = "Python"
# word[0] = "B" ეს გამოიტანს შეცდომას რადგან სტრინგები უცვლადია და  ინდექსით ელემენტის შეცვლა არ შე იძლება
# print(word)

# 3) შექმენით 10 ელემენტიანი რიცხვების სია და slicingის გამოყენებით დაბეჭდეთ ყოველი მესამე ელემენტი ამ სიაში

numbers = [1,2,3,4,5,6,7,8,9,10]
print(numbers[::3]) 

# 4) slicingის გამოყენებით იგივე სიიდან დაბეჭდეთ მე-4 მე-7 და მე-10 ელემენტები

print(numbers[3::3]) 