# არგუმენტი არის რაღაც მნიშვნელობა რასაც ფუნქციას ვაწვდიტ რომ იმუშაოს მასზე

# range არის პითონის ფუნქცია რომელიც ქმნის რიცხვების მიმდევრობას

# როცა range-ს ვაწვდით ერთ არგუმენტს მაგალითად range(5)
# ის ქმნის რიცხვებს 0-დან 5-მდე (5 არ ჩათვლით)

for i in range(5):
    print(i)

# როცა range-ს ვაწვდით ორ არგუმენტს, მაგალითად range(2, 6)
# პირველი არის საწყისი რიცხვი და მეორე - სადამდე მივიდეს (6 არ ჩათვლით)

for i in range(2, 6):
    print(i) 

# როცა range-ს ვაწვდით სამ არგუმენტს, მაგალითად range(1, 10, 2)
# აქ პირველი არის საწყისი მეორე - ბოლო და მესამე - რამდენი უნდა გადავიდეს

for i in range(1, 10, 2):
    print(i) 
