
# 2) კომენტარებით ახსენით რა არის slicing


# Slicing  არის სიიდან ელემენტების ნაწილის ამოღება ინდექსების დიაპაზონის მ ითითებით



# 3) გაიმეორეთ range ფუნქცია და გააკეთეთ 3 მაგალითი

# range ფუნქცია ქმნის რიცხვების მიმდევრობას მოცემული დიაპაზონით.
# მაგალითი 1:
for i in range(5):
    print(i) 

# მაგალითი 2:
for i in range(2, 7):
    print(i) 

# მაგალითი 3:
for i in range(1, 10, 2):
    print(i) 

# 4) შექმენით 10 ელემენტიანი სია და slicing-ის გამოყენებით დაბეჭდეთ სიის მე-2, მე-5 და მე-8 ელემენტი

my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
print(my_list[1])
print(my_list[4])
print(my_list[7]) 

# 5) slicing-ის გამოყენებით დაბეჭდეთ იგივე სიის მე-3 ელემენტიდან დაწყებული სიის ყველა ელემენტი

print(my_list[2:]) 
